Конфигурация/src/DataProcessors/РабочееМестоМенеджера/РабочееМестоМенеджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоМенеджера</name>
</mdclass:DataProcessor>

Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/DataProcessors/РабочееМестоМенеджера/Forms/Форма/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Тест
	Элементы.ТЕСТ_1.Видимость = Ложь;

	// Реквизиты
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();
	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
		Неопределено,
		Неопределено,
		Клиент,
		Цена
	);
	СуммаБалловОстаток = ИнформацияОКлиенте.СуммаБалловОстаток;
	ПроцентНакопления = ИнформацияОКлиенте.ПроцентНакопления;
	БаллыКНакоплению = ИнформацияОКлиенте.БаллыКНакоплению;
	ОбщийМодульВызовСервера.СоздатьДекорацииИзбранныхТоваров(ЭтотОбъект, Элементы);
	
	// Элементы
	Элементы.СписокНоменклатуры.Видимость = Ложь;
	Элементы.ПозицииПродажиПодбор.Пометка = Ложь;
	
	// Общие настройки всех подобных форм
	ОбщийМодульВызовСервера.ПридатьНачальныйВидФормеЗаказа(ЭтотОбъект, Объект, Элементы);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Клиент) Тогда
		ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьФормыСпискаНоменклатуры" Тогда
		Элементы.СписокНоменклатуры.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьФормуЗаказа" Тогда

		Если ЗначениеЗаполнено(Клиент) Тогда
			ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаллыНаСписаниеПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	ОбщийМодульКлиент.ПолучитьБаллыИПоказатьИнформацию(
		Неопределено,
		ЭтотОбъект,
		Объект,
		Неопределено,
		Цена,
		Клиент,
		МаксимальнаяДоляОплатыБаллами
	);
	
	КлиентПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБаллыКлиентаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	)
	
	ОбщийМодульКлиент.БаллыОбработкаСсылки(
		ЭтотОбъект,
		БаллыНаСписание,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка
	);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииПродажи

&НаКлиенте
Процедура ПозицииПродажиПроверкаПеретаскивания(
		Элемент,
		ПараметрыПеретаскивания,
		СтандартнаяОбработка,
		Строка,
		Поле
	)

	СтандартнаяОбработка = Ложь;

	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПеретаскивание(
		Элемент,
		ПараметрыПеретаскивания,
		СтандартнаяОбработка,
		Строка,
		Поле
	)
	
	ПараметрыПеретаскиванияЗначение = ПараметрыПеретаскивания.Значение; // см. ПолучитьЗначениеПеретаскиваемойСтроки

	Если ТипЗнч(ПараметрыПеретаскиванияЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	ОбщийМодульКлиент.ДобавитьУникальнуюПозицию(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		ПараметрыПеретаскиванияЗначение.Товар,
		ПараметрыПеретаскиванияЗначение.ЦенаЗаЕдиницу
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиТоварПриИзменении(Элемент)

	ОбщийМодульКлиент.ТоварПриИзменении(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		Элементы.ПозицииПродажи.ТекущиеДанные
	);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьСуммуПозиции(Элементы.ПозицииПродажи.ТекущиеДанные);
	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПослеУдаления(Элемент)

	ОбщийМодульКлиент.ПосчитатьИЗаписатьЗаказ(ЭтотОбъект, Объект, ПозицииПродажи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если (Строка(ДанныеСтроки.ВидНоменклатуры) = "Товар") И (ДанныеСтроки.Цена = 0) Тогда
		ОбщийМодульКлиент.СообщитьОНулевойЦене();
	КонецЕсли;
	
	ОбщийМодульКлиент.ДобавитьУникальнуюПозицию(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		ВыбраннаяСтрока,
		ДанныеСтроки.Цена
	);

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		
		Выполнение = Ложь;
		Возврат;
		
	КонецЕсли;

	Если (Строка(ДанныеСтроки.ВидНоменклатуры) = "Товар") И (ДанныеСтроки.Цена = 0) Тогда
		ОбщийМодульКлиент.СообщитьОНулевойЦене();
	КонецЕсли;
	
	ПеретаскиваемаяСтрока = ПолучитьЗначениеПеретаскиваемойСтроки(ДанныеСтроки);
	
	ПараметрыПеретаскивания.Значение = ПеретаскиваемаяСтрока;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиБесценное(Команда)
	
	ПровестиБесценноеНаСервере();
	Оповестить("ОбновитьФормыСпискаЗаказов");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗаказ(Команда)
	
	СозданныйДокумент = СохранитьЗаказНаСервере();

	Если Не ЗначениеЗаполнено(СозданныйДокумент) Тогда
		Возврат;
	КонецЕсли;

	ОповеститьОбИзменении(СозданныйДокумент);
	
	ПоказатьОповещениеПользователя(
		"Создан новый заказ",
		ПолучитьНавигационнуюСсылку(СозданныйДокумент),
		Строка(СозданныйДокумент),
		БиблиотекаКартинок.ЗакончитьРедактирование,
		СтатусОповещенияПользователя.Важное,
		"НовыйЗаказИзРабочегоМестаМенеджера"
	);

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)

	Элементы.СписокНоменклатуры.Видимость = Не Элементы.СписокНоменклатуры.Видимость;
	Элементы.ПозицииПродажиПодбор.Пометка = Элементы.СписокНоменклатуры.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ТЕСТ_1(Команда)
	
	ИнформацияОКлиенте = ОбщийМодульВызовСервера.ПолучитьИнформациюОКлиенте(
		Неопределено,
		Неопределено,
		Клиент,
		Цена
	);
	
	ОбщийМодульКлиент.ВывестиСтруктуру(ИнформацияОКлиенте);
	
	ТЕСТ_1НаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить значение перетаскиваемой строки.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыСтруктура - Данные строки
// 
// Возвращаемое значение:
//  Структура - Получить значение перетаскиваемой строки:
// * Товар - СправочникСсылка.Номенклатура - 
// * ЦенаЗаЕдиницу - Число - 
&НаКлиенте
Функция ПолучитьЗначениеПеретаскиваемойСтроки(ДанныеСтроки)

	ПеретаскиваемаяСтрока = Новый Структура();
	ПеретаскиваемаяСтрока.Вставить("Товар", ДанныеСтроки.Номенклатура);
	ПеретаскиваемаяСтрока.Вставить("ЦенаЗаЕдиницу", ДанныеСтроки.Цена);
	Возврат ПеретаскиваемаяСтрока;

КонецФункции

// Подключаемый декорация избранных товаров нажатие.
// 
// Параметры:
//  Элемент - ДекорацияФормы
&НаКлиенте
Процедура Подключаемый_ДекорацияИзбранныхТоваровНажатие(Элемент)
	
	ОбщийМодульКлиент.ИзбранныеНажатие(
		ЭтотОбъект,
		Объект,
		ПозицииПродажи,
		Элемент,
		ДинамическиеЭлементы
	);
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()

	ОбщийМодульВызовСервера.ЗаполнитьИзбранныеТовары(
		ЭтотОбъект,
		ДинамическиеЭлементы,
		Клиент
	);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиБесценноеНаСервере()
	Документы.Заказ.ПровестиДокументыСБесценнымиТоварами();
КонецПроцедуры

&НаСервере
Функция СохранитьЗаказНаСервере()

	ДокументЗаказ = Документы.Заказ.СоздатьДокумент();
	
	ДокументЗаказ.Заполнить(Неопределено);
	
	ДокументЗаказ.Дата = ТекущаяДатаСеанса();
	ДокументЗаказ.Клиент = Клиент;
	ДокументЗаказ.Цена = Цена;
	ДокументЗаказ.БаллыНаСписание = БаллыНаСписание;
	ДокументЗаказ.СуммаЗаказа = СуммаЗаказа;
	
	ДокументЗаказ.ПозицииПродажи.Загрузить(ПозицииПродажи.Выгрузить());

	Если Не ДокументЗаказ.ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ДокументЗаказ.Проведен Тогда

		ОбщийМодульВызовСервера.ОчиститьФорму(ЭтотОбъект, Объект, Элементы);
		Возврат ДокументЗаказ.Ссылка;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ТЕСТ_1НаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
